import { CulturalSpheres, IHistoricalData } from "./data.types";

export const historicalData: IHistoricalData = {
  1: {
    id: 1,
    start: 1981,
    end: 1987,
    sphere: CulturalSpheres.MUSIC,
    events: [
      {
        year: 1981,
        description: "1 августа начал вещание музыкальный канал MTV",
      },
      {
        year: 1982,
        description:
          "1 октября — Первые компакт-диски поступили в продажу в музыкальные магазины Японии",
      },
      {
        year: 1983,
        description:
          "27 июля — В США состоялся релиз одноимённого дебютного альбома Мадонны на лейбле «Warner Bros.»",
      },
      {
        year: 1984,
        description:
          "27 марта — В Лондоне состоялась премьера рок-мюзикла Эндрю Ллойда Уэббера «Звёздный Экспресс»",
      },
      {
        year: 1985,
        description:
          "Легендарный благотворительный концерт Live Aid 13 июля на стадионе Уэмбли в Лондоне и на стадионе им. Джона Ф. Кеннеди в Филадельфии.",
      },
      {
        year: 1986,
        description: "Из группы Pink Floyd официально уходит Роджер Уотерс",
      },
      {
        year: 1987,
        description:
          "3 января — Арета Франклин стала первой женщиной, чьё имя было занесено в Зал славы рок-н-ролла.",
      },
    ],
  },
  2: {
    id: 2,
    start: 1987,
    end: 1991,
    sphere: CulturalSpheres.CINEMA,
    events: [
      {
        year: 1987,
        description: "Золотой лев — «До свидания, дети» Луи Маля (Франция)",
      },
      {
        year: 1988,
        description:
          "Лучший фильм года — «Последний император» Бернардо Бертолуччи",
      },
      {
        year: 1989,
        description:
          "30 апреля скончался Серджо Леоне, итальянский режиссёр и сценарист.",
      },
      {
        year: 1990,
        description:
          "Вышел «Эдвард Руки-ножницы»/Edward Scissorhands, США (реж. Тим Бёртон)",
      },
      {
        year: 1991,
        description:
          "Вышел «Молчание ягнят»/The Silence of the Lambs, США, (реж. Джонатан Демми)",
      },
    ],
  },
  3: {
    id: 3,
    start: 1991,
    end: 1997,
    sphere: CulturalSpheres.LITERATURE,
    events: [
      {
        year: 1991,
        description: "Букеровская премия — Бен Окри, «Голодная дорога»",
      },
      {
        year: 1992,
        description: "В России учреждена литературная премия «Русский Букер».",
      },
      {
        year: 1993,
        description:
          "Премия Агаты — Каролин Харт[en], роман «Dead Man’s Island».",
      },
      {
        year: 1994,
        description: "Литературная премия Шведской академии — Ингер Кристенсен",
      },
      {
        year: 1995,
        description: "Букеровская премия — Пэт Баркер, «Дорога призраков»",
      },
      {
        year: 1996,
        description:
          "Пулитцеровская премия за художественную книгу — Ричард Форд, «День независимости» (англ. Independence day)",
      },
      {
        year: 1997,
        description: "Букеровская премия — Арундати Рой, «Бог мелочей»",
      },
    ],
  },
  4: {
    id: 4,
    start: 1997,
    end: 2004,
    sphere: CulturalSpheres.THEATER,
    events: [
      {
        year: 1997,
        description:
          "Начал работу единственный в Коста-Рике русский зарубежный театр «Арт — Х» (с 2012 Балаган-арт).",
      },
      {
        year: 1998,
        description:
          "В Москве прошёл III Международный театральный фестиваль имени А. П. Чехова",
      },
      {
        year: 1999,
        description:
          "Попытка реконструкции первоначальной версии балета «Спящая красавица» в Мариинском театре, постановка Сергея Вихарева",
      },
      {
        year: 2000,
        description:
          "Балерина Ирина Дворовенко стала прима-балериной Американского театра балета.",
      },
      {
        year: 2001,
        description:
          "Танцовщик Дэвид Макалистер[en] занял пост руководителя труппы «Австралийский балет».",
      },
      {
        year: 2002,
        description:
          "27 июня — премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон",
      },
      {
        year: 2003,
        description:
          "В Венеции после постановкой оперы Джузеппе Верди «Травиата» открылся театр «Ла Фениче», пострадавший в пожаре 1996 года.",
      },
      {
        year: 2004,
        description:
          "Московском драматическом театре им. А. С. Пушкина поставлен спектакль «Кот в сапогах» Ш.Перро",
      },
    ],
  },
  5: {
    id: 5,
    start: 2004,
    end: 2015,
    sphere: CulturalSpheres.SPORT,
    events: [
      {
        year: 2004,
        description: "Расформирован бейсбольный клуб «Монреаль Экспос»;",
      },
      {
        year: 2005,
        description:
          "Чемпион мира по шахматам Веселин Топалов заявил, что он не собирается играть матч на первенство мира против Владимира Крамника",
      },
      {
        year: 2006,
        description:
          "Баскетбольный клуб ЦСКА стал победителем национального первенства России",
      },
      {
        year: 2007,
        description:
          "Дэвид Бекхэм объявил о том, что продолжит свою карьеру в американском клубе Лос-Анджелес Гэлакси",
      },
      {
        year: 2008,
        description:
          "С 8 по 24 августа в Пекине прошли 29-е летние Олимпийские игры.",
      },
      {
        year: 2009,
        description: "Динара Сафина впервые стала первой ракеткой мира.",
      },
      {
        year: 2010,
        description:
          "13—28 февраля в Ванкувере: Зимние Олимпийские игры 2010 года.",
      },
      {
        year: 2011,
        description: "На гонках «Индикар» погиб автогонщик Дэн Уэлдон.",
      },
      {
        year: 2012,
        description:
          " сборная Чехия по теннису впервые с 1980 года выиграла Кубок Дэвиса, победив в финале сборную Испании",
      },
      {
        year: 2013,
        description:
          "Сборная Норвегии по биатлону установила рекорд чемпионатов мира по биатлону, выиграв 8 из 11 золотых медалей",
      },
      {
        year: 2014,
        description:
          "Динамо-Казань» в четвёртый раз подряд выиграло женскую Суперлигу[86].",
      },
      {
        year: 2015,
        description:
          "в 119-м бостонском марафоне гонку выиграл эфиопский атлет Лелиса Десиса",
      },
    ],
  },
  6: {
    id: 6,
    start: 2015,
    end: 2022,
    sphere: CulturalSpheres.SCIENCE,
    events: [
      {
        year: 2015,
        description:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        year: 2016,
        description:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        year: 2017,
        description:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        year: 2018,
        description:
          "Итальянским учёным удалось создать первую бионическую руку с ощущением осязания",
      },
      {
        year: 2019,
        description: "запуск первого частного космического объекта к Луне",
      },
      {
        year: 2020,
        description:
          "Ванесса О’Брайен покорила Марианскую впадину, став первой женщиной, покорившей Эверест и глубочайшую точку Земли",
      },
      {
        year: 2021,
        description:
          "в Китае развёрнута первая в мире интегрированная сеть квантовой связи",
      },
      {
        year: 2022,
        description:
          "На БАК обнаружены загадочные X-частицы, ранее предполагаемые только теоретически",
      },
    ],
  },
};
